{"title": "Roast Butter Chicken and Smashed Potatoes", "description": "We have given the classic roast chook a butter chicken twist. Coated in a golden, butter chicken marinade, the flavor-packed chicken and super crispy smashed potatoes make the ultimate weeknight dinner. Plus, it only takes 10 minutes to prep!", "cuisine": "Unknown", "slug": "roast-butter-chicken-and-smashed-potatoes", "cookTime": "Unknown", "ingredients": ["Chicken (whole or parts)", "Butter chicken marinade", "Potatoes", "Salt and pepper to taste"], "method": ["1. Preheat your oven to the specified temperature (fill this in if available).", "2. Prepare the chicken by coating it with the butter chicken marinade.", "3. Place the chicken in a roasting pan.", "4. Wash and chop the potatoes into smaller pieces.", "5. Arrange the potatoes around the chicken in the roasting pan.", "6. Season the chicken and potatoes with salt and pepper to taste.", "7. Roast in the preheated oven for the specified time until the chicken is cooked through and the potatoes are crispy.", "8. Serve and enjoy!"], "nutritionalInfo": "Unknown", "prepTime": "10 minutes", "tags": ["roast", "butter chicken", "potatoes", "weeknight dinner"], "source": "https://www.taste.com.au/quick-easy/galleries/cook-now-our-most-recent-recipes-day"}
{"title": "Cauliflower and Broccoli Cheese Pie", "description": "My Dutch grandmother made a cauliflower cheese bake sprinkled with crispy breadcrumbs when I was a little girl. This is where the initial inspiration for this pie came from. We added broccoli and turned it into a cauliflower broccoli cheese pie. As a vegetarian myself, it’s a real treat! We’ve had it on offer every winter at our family-owned bakery for the past three years.", "cuisine": "Unknown", "slug": "cauliflower-and-broccoli-cheese-pie", "cookTime": "-", "ingredients": ["2 sheets frozen puff pastry, thawed", "1/2 cup (25g) panko breadcrumbs", "2 tbs extra virgin olive oil", "1 1/4 cups (150g) grated four-cheese blend", "Salad leaves, to serve (optional)", "500g each broccoli and cauliflower", "4 cups (1L) milk, plus 300ml extra", "2 tsp each of black pepper and fine salt", "11 /2 tsp each of sweet paprika and garlic powder", "1/4 tsp freshly grated nutmeg", "125g cornflour", "2 1/2 cups (300g) grated four-cheese blend"], "method": ["1.For the filling, wash broccoli and cauliflower (water helps steam vegetables in microwave). Cut stalks off both (reserve to add to a stir-fry or soup) and roughly chop broccoli. Use fingers to crumble cauliflower into small pieces. Place in a large heatproof bowl and microwave on medium-high for 5 minutes, stirring a few times, until just tender. Drain any liquid, then cool to room temperature.", "2.Place milk and all spices in a large saucepan over medium-high heat and bring to the boil, whisking occasionally. Meanwhile, whisk the cornflour and extra milk in a jug until smooth and combined. Remove pan from heat and vigorously whisk cornflour mixture into the boiled milk, then return to medium heat and cook, stirring constantly, until mixture thickens. Add cheese and stir until melted, then stir in drained vegetables. Transfer to a large heatproof bowl and cool to room temperature, then cover and chill for 1 hour.", "3.Preheat oven to 240°C/220°C fan-forced. Place a baking tray in the oven to preheat. Grease a 26cm round pie dish (4cm deep, 8-cup capacity) and line with pastry, cutting and pasting sheets to fit. Spoon in filling, pressing down firmly and creating a lovely domed top. Rub crumbs and oil together in a small bowl and sprinkle evenly over top, then sprinkle over with cheese.", "4.Bake on preheated tray for 10 minutes. Reduce oven to 200°C/180°C fan-forced and bake for 45-50 minutes until pastry is cooked and top is deep golden. Rest in pan for 15 minutes, then slice and serve with salad leaves, if desired."], "nutritionalInfo": "Unknown", "prepTime": "-", "tags": ["cauliflower", "broccoli", "cheese", "vegetarian", "pie"], "source": "https://www.delicious.com.au/recipes/broccoli-cauliflower-cheese-pie-recipe/1vq4cqx4"}
{"title": "Tuscan Chicken Pie with Prosciutto", "description": "I always think about foods and cuisines I enjoy eating, and then find a way to translate those flavours and feelings into a pie. It has to evoke emotion. This pie made me feel FOMO from not jetting to Europe this winter! We wanted to create something unique for delicious, so we whipped this pie up especially, but we might release it as a limited-edition pie. – Darren Rowe, Pinjarra Bakery WA", "cuisine": "Unknown", "slug": "tuscan-chicken-pie-with-prosciutto", "cookTime": "-", "ingredients": ["Unknown"], "method": ["Unknown"], "nutritionalInfo": "Unknown", "prepTime": "-", "tags": ["tuscan", "chicken", "prosciutto", "pie"], "source": "delicious.com.au"}
